<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.lambda_functions.data.archive_file.daily_coffee: Reading...
module.lambda_functions.data.archive_file.populate_coffee_pool: Reading...
module.lambda_functions.data.archive_file.populate_coffee_pool: Read complete after 0s [id=5f90b0d34696d9037bc9b6c01cb4b5bd8996545c]
module.lambda_functions.data.archive_file.daily_coffee: Read complete after 0s [id=10f3e7bfd18b005e7607502a64ef59a3d3605cd7]
module.lambda_functions.aws_iam_role.lambda: Refreshing state... [id=terraform_aws_lambda_role-dev]
module.lambda_functions.aws_iam_policy.lambda: Refreshing state... [id=arn:aws:iam::057149530255:policy/aws_iam_policy_for_terraform_aws_lambda_role-dev]
module.dynamodb_tables.aws_dynamodb_table.coffee_pool: Refreshing state... [id=coffee_pool-dev]
module.lambda_functions.aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role: Refreshing state... [id=terraform_aws_lambda_role-dev-20231019175631352300000001]
module.lambda_functions.aws_lambda_function.daily_coffee: Refreshing state... [id=daily_coffee-dev]
module.api_app.aws_api_gateway_rest_api.this: Refreshing state... [id=jfrfryrkn3]
module.api_app.aws_api_gateway_resource.root: Refreshing state... [id=sogf0r]
module.api_app.aws_api_gateway_resource.daily_coffee: Refreshing state... [id=undac0]
module.api_app.aws_api_gateway_method.daily_coffee: Refreshing state... [id=agm-jfrfryrkn3-undac0-GET]
module.api_app.aws_api_gateway_integration.daily_coffee: Refreshing state... [id=agi-jfrfryrkn3-undac0-GET]
module.api_app.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_app.aws_api_gateway_deployment.dev: Refreshing state... [id=ujfnb3]
module.api_app.aws_api_gateway_stage.dev: Refreshing state... [id=ags-jfrfryrkn3-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.lambda_functions.aws_lambda_function.daily_coffee will be updated in-place
  ~ resource "aws_lambda_function" "daily_coffee" {
        id                             = "daily_coffee-dev"
      ~ last_modified                  = "2023-10-22T22:12:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "qTvY0b/UoUOJPfXavunIiKzXqUNYFxCKugCh6PUTN2Y=" -> "E6m76ijMEcULwsMif8tAZ/v9lVIt5kqRjcrVt3KgddQ="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_functions.aws_lambda_function.populate_coffee_pool will be created
  + resource "aws_lambda_function" "populate_coffee_pool" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../modules/lambda_functions/populate_coffee_pool/populate_coffee_pool.zip"
      + function_name                  = "populate_coffee_pool-dev"
      + handler                        = "populate_coffee_pool.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::057149530255:role/terraform_aws_lambda_role-dev"
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ZXlam6ux2IGN1nLbvEqAfT8lBbDxei+3u6YOia3O+n0="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "COFFEE_POOL_TABLE_NAME" = "coffee_pool-dev"
              + "REGION"                 = "eu-south-2"
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`